tmp/wsl_bench/arc_run1.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   124.99ms  280.50ms   1.92s    88.55%
    Req/Sec   230.25    200.05     0.99k    71.21%
  Latency Distribution
     50%   18.05ms
     75%   41.67ms
     90%  517.50ms
     99%    1.24s 
  14759 requests in 10.02s, 3.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 44
Requests/sec:   1472.36
Transfer/sec:    324.95KB