tmp/wsl_bench/arc_run2.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.23ms  209.89ms   1.92s    92.57%
    Req/Sec   196.31    125.96   740.00     66.67%
  Latency Distribution
     50%   19.62ms
     75%   35.31ms
     90%   67.15ms
     99%    1.06s 
  13965 requests in 10.02s, 3.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 20
Requests/sec:   1393.45
Transfer/sec:    307.54KB