tmp/wsl_bench/arc_run3.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   111.94ms  226.66ms   1.98s    91.39%
    Req/Sec   187.89    123.34   620.00     64.04%
  Latency Distribution
     50%   40.77ms
     75%   67.45ms
     90%  195.18ms
     99%    1.08s 
  14286 requests in 10.03s, 3.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 37
Requests/sec:   1424.42
Transfer/sec:    314.37KB