tmp/wsl_bench/backend_run1.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    60.85ms  132.03ms   1.84s    97.66%
    Req/Sec   201.45    130.27     0.89k    66.39%
  Latency Distribution
     50%   33.92ms
     75%   61.30ms
     90%   98.23ms
     99%  743.61ms
  14733 requests in 10.02s, 2.84MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
Requests/sec:   1470.01
Transfer/sec:    290.02KB