tmp/wsl_bench/backend_run2.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.35ms  106.15ms   1.74s    98.20%
    Req/Sec   223.37    196.16     1.15k    69.45%
  Latency Distribution
     50%   27.88ms
     75%   50.19ms
     90%   77.88ms
     99%  388.75ms
  15775 requests in 10.01s, 3.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 20
Requests/sec:   1575.37
Transfer/sec:    310.80KB