tmp/wsl_bench/backend_run3.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.88ms  103.34ms   1.73s    97.97%
    Req/Sec   233.04    161.14     0.88k    72.16%
  Latency Distribution
     50%   23.42ms
     75%   39.22ms
     90%   60.72ms
     99%  441.08ms
  15553 requests in 10.02s, 3.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:   1551.56
Transfer/sec:    306.19KB