tmp/wsl_bench/nginx_run1.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    86.84ms  200.53ms   1.92s    93.96%
    Req/Sec   228.03    182.95   810.00     63.15%
  Latency Distribution
     50%   35.58ms
     75%   58.36ms
     90%   97.32ms
     99%    1.08s 
  14461 requests in 10.02s, 2.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 14
Requests/sec:   1442.65
Transfer/sec:    295.86KB