tmp/wsl_bench/nginx_run2.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    89.23ms  217.97ms   1.87s    91.65%
    Req/Sec   228.79    176.78     0.95k    63.88%
  Latency Distribution
     50%   23.16ms
     75%   44.25ms
     90%  115.40ms
     99%    1.07s 
  14753 requests in 10.02s, 2.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:   1472.66
Transfer/sec:    302.01KB