tmp/wsl_bench/nginx_run3.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    91.87ms  217.30ms   1.88s    92.69%
    Req/Sec   208.67    207.56     1.10k    81.85%
  Latency Distribution
     50%   28.39ms
     75%   53.31ms
     90%  117.17ms
     99%    1.08s 
  13582 requests in 10.10s, 2.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:   1344.71
Transfer/sec:    275.77KB